# AssemblyNamingCategory Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AssemblyNamingCategory Property
ParameterTypeId Class See Also
---
"Naming Category"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AssemblyNamingCategory { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AssemblyNamingCategory As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AssemblyNamingCategory {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace